UIpiece/app/Models/CartModel.php

SELECT `produk`.`name`, `produk`.`price`, `cart`.`quantity`, `cart`.`id`, (produk.price * cart.quantity) as subtotal
FROM `cart`
JOIN `produk` ON `produk`.`id` = `cart`.`product_id`
---
    public function getCart()
    {
        return $this->join('produk', 'produk.id = cart.product_id')
            ->select('produk.name, produk.price, cart.quantity, cart.id, (produk.price * cart.quantity) as subtotal')
            ->findAll();